#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()
{

	return 0;
}

int main2()
{
	//a：00000000 00000000 00000000 10000000 补码
	//截断 a->10000000
	//此时a还是存入的是负数
	//剩下和main1同理
	char a = 128;
	printf("%d,%u", a,a);//-128,4294967168
	return 0;
}

int main1()
{
	//a:
	//10000000 00000000 00000000 10000000   原码
	//11111111 11111111 11111111 01111111   反码
	//11111111 11111111 11111111 10000000   补码
	//由于要存入char类型中，所以发生截断 ： a->10000000(补码)
	char a = -128;
	//char类型发生整形提升：（负数补1，正数补0，无符号整形补0）
	// 这里的a是负数，所以高位补0
	//11111111 11111111 11111111 10000000（补码）
	//由于要输出无符号整形，所以将上面补码转化为十进制数即可
	printf("%u", a);//4294967168
	return 0;
}

int main0()
{
	//存入数据时不看是否是unsigned\signed 直接存入
	//a->11111111
	//b->11111111
	//c->11111111
	//当使用时才看变量是否为有符号数，
	char a = -1;
	signed char b = -1;
	unsigned char c = -1;
	//char->int发生整形提升
	printf("%d %d %d\n", a, b, c);
	return 0;
}